<a href="https://colab.research.google.com/github/EddyAlarconR/curso_python_dmc/blob/main/Sesion6_Phyton.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## SERIES EN PANDAS

In [ ]:
serie = pd.Series([1979, 1980, 1981, 1982])
serie

0    1979
1    1980
2    1981
3    1982
dtype: int64

In [ ]:
serie.values

array([1979, 1980, 1981, 1982])

In [ ]:
serie.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
serie = pd.Series(data=[1979, 1980, 1981, 1982, 1983],
                  index=['carolina', 'martha', 'nicky', 'theresa', 'nicky'])
serie

carolina    1979
martha      1980
nicky       1981
theresa     1982
nicky       1983
dtype: int64

## ACCESO A DATOS EN SERIES

In [ ]:
serie_pokemon = pd.read_csv('pokemon.csv', squeeze=True, usecols=['Name'])
serie_pokemon

0           Bulbasaur
1             Ivysaur
2            Venusaur
3       Mega Venusaur
4          Charmander
            ...
795           Diancie
796      Mega Diancie
797    Hoopa Confined
798     Hoopa Unbound
799         Volcanion
Name: Name, Length: 800, dtype: object

In [ ]:
serie = pd.Series(data=[1979, 1980, 1981, 1982, 1983],
                  index=['carolina', 'martha', 'nicky', 'theresa', 'nicky'])
serie

carolina    1979
martha      1980
nicky       1981
theresa     1982
nicky       1983
dtype: int64

In [ ]:
print(serie['martha'])

1980

In [ ]:
print(serie[1])

1980

In [ ]:
print(serie['nicky'])

nicky    1981
nicky    1983
dtype: int64

In [ ]:
serie[1:]

martha     1980
nicky      1981
theresa    1982
nicky      1983
dtype: int64

In [ ]:
serie[1:3]

martha    1980
nicky     1981
dtype: int64

In [ ]:
serie[-4:-2]

martha    1980
nicky     1981
dtype: int64

##MÉTODOS EN SERIES

In [ ]:
serie.sort_values()

carolina    1979
martha      1980
nicky       1981
theresa     1982
nicky       1983
dtype: int64

In [ ]:
serie.sort_values(ascending=False)

nicky       1983
theresa     1982
nicky       1981
martha      1980
carolina    1979
dtype: int64

In [ ]:
serie_pokemon.sort_values(inplace=True)
serie_pokemon

510                Abomasnow
68                      Abra
392                    Absol
678                 Accelgor
750    Aegislash Blade Forme
               ...
631                    Zorua
46                     Zubat
695                 Zweilous
794       Zygarde Half Forme
62                       NaN
Name: Name, Length: 800, dtype: object

In [ ]:
serie_pokemon.sort_index()

0           Bulbasaur
1             Ivysaur
2            Venusaur
3       Mega Venusaur
4          Charmander
            ...
795           Diancie
796      Mega Diancie
797    Hoopa Confined
798     Hoopa Unbound
799         Volcanion
Name: Name, Length: 800, dtype: object

In [ ]:
serie_pokemon.value_counts()

Silcoon           1
Toxicroak         1
Venipede          1
Gliscor           1
Gardevoir         1
                 ..
Mega Salamence    1
Treecko           1
Corsola           1
Doublade          1
Bronzor           1
Name: Name, Length: 799, dtype: int64

##Dataframes en Pandas

In [ ]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.DataFrame({'nombre': ['Pablo', 'Teresa'],
                   'score': [22.2, 33.3]},
                  index=['id1', 'id2'])
df

     nombre  score
id1   Pablo   22.2
id2  Teresa   33.3

In [ ]:
nba = pd.read_csv('nba.csv')

In [ ]:
nba.columns

Index(['Player', 'height', 'weight', 'collage', 'born', 'birth_city',
       'birth_state'],
      dtype='object')

In [ ]:
nba.head(10)

            Player  height  weight  ...    born     birth_city   birth_state
0  Curly Armstrong   180.0    77.0  ...  1918.0            NaN           NaN
1     Cliff Barker   188.0    83.0  ...  1921.0       Yorktown       Indiana
2    Leo Barnhorst   193.0    86.0  ...  1924.0            NaN           NaN
3       Ed Bartels   196.0    88.0  ...  1925.0            NaN           NaN
4      Ralph Beard   178.0    79.0  ...  1927.0    Hardinsburg      Kentucky
5       Gene Berce   180.0    79.0  ...  1926.0            NaN           NaN
6    Charlie Black   196.0    90.0  ...  1921.0           Arco         Idaho
7      Nelson Bobb   183.0    77.0  ...  1924.0   Philadelphia  Pennsylvania
8  Jake Bornheimer   196.0    90.0  ...  1927.0  New Brunswick    New Jersey
9     Vince Boryla   196.0    95.0  ...  1927.0   East Chicago       Indiana

[10 rows x 7 columns]

## Acceso a datos en Dataframes

In [ ]:
nba['Player']  # dict type

NameError: ignored

In [ ]:
nba['Player']  # dict type

NameError: ignored

In [ ]:
nba[['Player']]

In [ ]:
type(nba.Player), type(nba['Player']), type(nba[['Player']])

In [ ]:
nba[['Player','height']]

In [ ]:
df

In [ ]:
df.loc['id2']

In [ ]:
df.iloc[1]

In [ ]:
df.iloc[1]['score']

## Métodos en Dataframes

In [ ]:
data = pd.read_csv('baseball.csv')

In [ ]:
data.shape

(100, 23)

In [ ]:
data.values

array([[88641, 'womacto01', 2006, ..., 3.0, 0.0, 0.0],
       [88643, 'schilcu01', 2006, ..., 0.0, 0.0, 0.0],
       [88645, 'myersmi01', 2006, ..., 0.0, 0.0, 0.0],
       ...,
       [89530, 'ausmubr01', 2007, ..., 4.0, 1.0, 11.0],
       [89533, 'aloumo01', 2007, ..., 0.0, 3.0, 13.0],
       [89534, 'alomasa02', 2007, ..., 0.0, 0.0, 0.0]], dtype=object)

In [ ]:
data.head()

      id     player  year  stint team  lg  ...   so  ibb  hbp   sh   sf  gidp
0  88641  womacto01  2006      2  CHN  NL  ...  4.0  0.0  0.0  3.0  0.0   0.0
1  88643  schilcu01  2006      1  BOS  AL  ...  1.0  0.0  0.0  0.0  0.0   0.0
2  88645  myersmi01  2006      1  NYA  AL  ...  0.0  0.0  0.0  0.0  0.0   0.0
3  88649  helliri01  2006      1  MIL  NL  ...  2.0  0.0  0.0  0.0  0.0   0.0
4  88650  johnsra05  2006      1  NYA  AL  ...  4.0  0.0  0.0  0.0  0.0   0.0

[5 rows x 23 columns]

In [ ]:
data.tail(3)

       id     player  year  stint team  lg  ...    so  ibb  hbp   sh   sf  gidp
97  89530  ausmubr01  2007      1  HOU  NL  ...  74.0  3.0  6.0  4.0  1.0  11.0
98  89533   aloumo01  2007      1  NYN  NL  ...  30.0  5.0  2.0  0.0  3.0  13.0
99  89534  alomasa02  2007      1  NYN  NL  ...   3.0  0.0  0.0  0.0  0.0   0.0

[3 rows x 23 columns]

In [ ]:
data.describe(include='all')

                  id     player        year  ...          sh          sf        gidp
count     100.000000        100   100.00000  ...  100.000000  100.000000  100.000000
unique           NaN         82         NaN  ...         NaN         NaN         NaN
top              NaN  trachst01         NaN  ...         NaN         NaN         NaN
freq             NaN          2         NaN  ...         NaN         NaN         NaN
mean    89352.660000        NaN  2006.92000  ...    1.380000    1.200000    3.540000
std       218.910859        NaN     0.27266  ...    2.919042    2.035046    5.201826
min     88641.000000        NaN  2006.00000  ...    0.000000    0.000000    0.000000
25%     89353.500000        NaN  2007.00000  ...    0.000000    0.000000    0.000000
50%     89399.000000        NaN  2007.00000  ...    0.000000    0.000000    1.000000
75%     89465.250000        NaN  2007.00000  ...    1.000000    2.000000    6.000000
max     89534.000000        NaN  2007.00000  ...   14.000000    9.000000   21.000000

[11 rows x 23 columns]

In [ ]:
data.dtypes

id          int64
player     object
year        int64
stint       int64
team       object
lg         object
g           int64
ab          int64
r           int64
h           int64
X2b         int64
X3b         int64
hr          int64
rbi       float64
sb        float64
cs        float64
bb          int64
so        float64
ibb       float64
hbp       float64
sh        float64
sf        float64
gidp      float64
dtype: object

In [ ]:
data.axes

[RangeIndex(start=0, stop=100, step=1),
 Index(['id', 'player', 'year', 'stint', 'team', 'lg', 'g', 'ab', 'r', 'h',
        'X2b', 'X3b', 'hr', 'rbi', 'sb', 'cs', 'bb', 'so', 'ibb', 'hbp', 'sh',
        'sf', 'gidp'],
       dtype='object')]

In [ ]:
data.nunique()

id        100
player     82
year        2
stint       2
team       27
lg          2
g          60
ab         63
r          38
h          46
X2b        28
X3b         5
hr         22
rbi        43
sb         12
cs          7
bb         40
so         47
ibb        13
hbp        10
sh         14
sf          9
gidp       17
dtype: int64